app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Software Engineering"], ["room_number", 10]]
---
  def create
    # raise params.inspect
    @school_class = SchoolClass.create post_params(:title, :room_number)

UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["id", 1]]
---
  def update
    set_school_class
    @school_class.update post_params(:title)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_school_class
    @school_class = SchoolClass.find params[:id]