app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-01-05 07:39:39.994148"], ["updated_at", "2019-01-05 07:39:39.994148"]]
---
  def create
    # raise params.inspect
    @student = Student.create post_params(:first_name, :last_name)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-01-05 07:44:39.067055"], ["id", 1]]
---
  def update
    set_student
    @student.update post_params(:first_name, :last_name)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_student
    @student = Student.find params[:id]